; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-2-9)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	)
(:init
	(at plane1 city0)
	(= (capacity plane1) 2230)
	(= (fuel plane1) 374)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 2)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 5)
	(at plane2 city3)
	(= (capacity plane2) 6358)
	(= (fuel plane2) 2536)
	(= (slow-burn plane2) 3)
	(= (fast-burn plane2) 9)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 7)
	(at person1 city4)
	(at person2 city5)
	(at person3 city5)
	(at person4 city0)
	(at person5 city4)
	(at person6 city1)
	(at person7 city4)
	(at person8 city0)
	(at person9 city5)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 744)
	(= (distance city0 city2) 775)
	(= (distance city0 city3) 898)
	(= (distance city0 city4) 946)
	(= (distance city0 city5) 531)
	(= (distance city1 city0) 744)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 987)
	(= (distance city1 city3) 899)
	(= (distance city1 city4) 688)
	(= (distance city1 city5) 565)
	(= (distance city2 city0) 775)
	(= (distance city2 city1) 987)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 565)
	(= (distance city2 city4) 803)
	(= (distance city2 city5) 947)
	(= (distance city3 city0) 898)
	(= (distance city3 city1) 899)
	(= (distance city3 city2) 565)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 561)
	(= (distance city3 city5) 588)
	(= (distance city4 city0) 946)
	(= (distance city4 city1) 688)
	(= (distance city4 city2) 803)
	(= (distance city4 city3) 561)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 727)
	(= (distance city5 city0) 531)
	(= (distance city5 city1) 565)
	(= (distance city5 city2) 947)
	(= (distance city5 city3) 588)
	(= (distance city5 city4) 727)
	(= (distance city5 city5) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city1)
	(at person1 city0)
	(at person2 city4)
	(at person3 city5)
	(at person4 city0)
	(at person5 city2)
	(at person6 city4)
	(at person7 city4)
	(at person8 city1)
	(at person9 city1)
	))

(:metric minimize (+ (* 1 (total-time))  (* 3 (total-fuel-used))))
)

; plan
1. (fly plane2 city3 city2)
   deleted: (at plane2 city3)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 0 to 1695, (fuel plane2) from 2536 to 841
   goals met: 3 of 10
2. (refuel plane1 city0)
   changed: (fuel plane1) from 374 to 2230
   goals met: 3 of 10
3. (board person8 plane1 city0)
   deleted: (at person8 city0)
   added: (in person8 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 10
4. (fly plane1 city0 city1)
   deleted: (at plane1 city0)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 1695 to 2439, (fuel plane1) from 2230 to 1486
   goals met: 4 of 10
5. (debark person8 plane1 city1)
   deleted: (in person8 plane1)
   added: (at person8 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 5 of 10
6. (board person6 plane1 city1)
   deleted: (at person6 city1)
   added: (in person6 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 5 of 10
7. (fly plane1 city1 city5)
   deleted: (at plane1 city1)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 2439 to 3004, (fuel plane1) from 1486 to 921
   goals met: 4 of 10
8. (board person2 plane1 city5)
   deleted: (at person2 city5)
   added: (in person2 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 4 of 10
9. (board person9 plane1 city5)
   deleted: (at person9 city5)
   added: (in person9 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 4 of 10
10. (fly plane1 city5 city1)
   deleted: (at plane1 city5)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 3004 to 3569, (fuel plane1) from 921 to 356
   goals met: 5 of 10
11. (debark person9 plane1 city1)
   deleted: (in person9 plane1)
   added: (at person9 city1)
   changed: (onboard plane1) from 3 to 2
   goals met: 6 of 10
12. (refuel plane1 city1)
   changed: (fuel plane1) from 356 to 2230
   goals met: 6 of 10
13. (fly plane1 city1 city4)
   deleted: (at plane1 city1)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 3569 to 4257, (fuel plane1) from 2230 to 1542
   goals met: 5 of 10
14. (debark person2 plane1 city4)
   deleted: (in person2 plane1)
   added: (at person2 city4)
   changed: (onboard plane1) from 2 to 1
   goals met: 6 of 10
15. (debark person6 plane1 city4)
   deleted: (in person6 plane1)
   added: (at person6 city4)
   changed: (onboard plane1) from 1 to 0
   goals met: 7 of 10
16. (board person1 plane1 city4)
   deleted: (at person1 city4)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 7 of 10
17. (board person5 plane1 city4)
   deleted: (at person5 city4)
   added: (in person5 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 7 of 10
18. (fly plane1 city4 city1)
   deleted: (at plane1 city4)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 4257 to 4945, (fuel plane1) from 1542 to 854
   goals met: 8 of 10
19. (refuel plane1 city1)
   changed: (fuel plane1) from 854 to 2230
   goals met: 8 of 10
20. (fly plane1 city1 city0)
   deleted: (at plane1 city1)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 4945 to 5689, (fuel plane1) from 2230 to 1486
   goals met: 7 of 10
21. (debark person1 plane1 city0)
   deleted: (in person1 plane1)
   added: (at person1 city0)
   changed: (onboard plane1) from 2 to 1
   goals met: 8 of 10
22. (fly plane1 city0 city1)
   deleted: (at plane1 city0)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 5689 to 6433, (fuel plane1) from 1486 to 742
   goals met: 9 of 10
23. (refuel plane1 city1)
   changed: (fuel plane1) from 742 to 2230
   goals met: 9 of 10
24. (fly plane1 city1 city2)
   deleted: (at plane1 city1)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 6433 to 7420, (fuel plane1) from 2230 to 1243
   goals met: 8 of 10
25. (debark person5 plane1 city2)
   deleted: (in person5 plane1)
   added: (at person5 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 9 of 10
26. (fly plane1 city2 city1)
   deleted: (at plane1 city2)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 7420 to 8407, (fuel plane1) from 1243 to 256
   goals met: 10 of 10
